tests/performance/load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 10
      arrivalRate: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 20
      name: Traffic spike
    - duration: 30
      arrivalRate: 2
      name: Recovery phase
  defaults:
    headers:
      User-Agent: "Artillery Load Test"
  http:
    pool: 10
    timeout: 30000
  outputFormat: json

scenarios:
  - name: "Load Test SEO Tools"
    weight: 100
    flow:
      - get:
          url: "/"
      - wait: 1
      - get:
          url: "/apps/dashboard"
      - wait: 2
      - get:
          url: "/api/ai/status"
      - wait: 1
      - get:
          url: "/apps/gsc-ctr-miner"
      - wait: 3
      # Skip POST to a page route; only GET pages under load
      - get:
          url: "/apps/utm-qr"
      - wait: 2
      - get:
          url: "/apps/utm-dashboard"
      - wait: 1

  - name: "Stress AI Endpoints"
    weight: 30
    flow:
      - get:
          url: "/api/health"
      - wait: 0.5
      - get:
          url: "/api/ai/status"
      - wait: 1
      # Skip POST to external AI service when OPENAI_API_KEY is not configured
      - wait: 2

  - name: "Concurrent Tool Usage"
    weight: 40
    flow:
      - get:
          url: "/apps/review-composer"
      - wait: 2
      # Avoid POST to page endpoints; simulate navigation only
      - wait: 1
      - get:
          url: "/apps/addon-recommender"
      - wait: 3
      - get:
          url: "/apps/rank-grid"
      - wait: 2